In [1]:
import pandas as pd
from flask import Flask, request, render_template, jsonify
from config import remote_db_endpoint, remote_db_port, remote_db_user, remote_db_pwd, remote_db_name

In [2]:
import pymysql
import sqlalchemy
from sqlalchemy import create_engine
from sqlalchemy import create_engine

## Make Connection

In [3]:
pymysql.install_as_MySQLdb()
engine = create_engine(f"mysql://{remote_db_user}:{remote_db_pwd}@{remote_db_endpoint}:{remote_db_port}/{remote_db_name}")

In [4]:
conn = engine.connect()

## ETL - SP500

In [5]:
file = "../static/data/SP500.csv"
SP500 = pd.read_csv(file)
SP500.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2000-01-03,1469.250000,1478.000000,1438.359985,1455.219971,1455.219971,931800000
1,2000-01-04,1455.219971,1455.219971,1397.430054,1399.420044,1399.420044,1009000000
2,2000-01-05,1399.420044,1413.270020,1377.680054,1402.109985,1402.109985,1085500000
3,2000-01-06,1402.109985,1411.900024,1392.099976,1403.449951,1403.449951,1092300000
4,2000-01-07,1403.449951,1441.469971,1400.729980,1441.469971,1441.469971,1225200000

In [6]:
SP500.to_sql(name = "sp500", if_exists="append", con=conn, index=False)

In [9]:
query = '''
select * from SP500
'''
remote_SP500 = pd.read_sql(query, conn)
remote_SP500.head(2)

        Date  Open  High   Low  Close  Adj Close      Volume
0 2000-01-03  1469  1478  1438   1455       1455   931800000
1 2000-01-04  1455  1455  1397   1399       1399  1009000000

## ETL DJones

In [10]:
file = "../static/data/DJONES.csv"
DJONES = pd.read_csv(file)
DJONES.head(2)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2000-01-03,11501.849609,11522.009766,11305.690430,11357.509766,11357.509766,1697500
1,2000-01-04,11349.750000,11350.059570,10986.450195,10997.929688,10997.929688,1784200

In [11]:
DJONES.to_sql(name = "DJones", if_exists = "append", con=conn, index=False)

In [12]:
query = '''
select * from DJones
'''
remote_DJones = pd.read_sql(query, conn)
remote_DJones.head(2)

        Date   Open   High    Low  Close  Adj Close   Volume
0 2000-01-03  11502  11522  11306  11358      11358  1697500
1 2000-01-04  11350  11350  10986  10998      10998  1784200

## ETL Nasdaq

In [13]:
file = "../static/data/NASDAQ.csv"
NASDAQ = pd.read_csv(file)
NASDAQ.head(2)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2000-01-03,4186.189941,4192.189941,3989.709961,4131.149902,4131.149902,1510070000
1,2000-01-04,4020.000000,4073.250000,3898.229980,3901.689941,3901.689941,1511840000

In [14]:
NASDAQ.to_sql(name = "NASDAQ", if_exists = "append", con=conn, index=False)

In [15]:
query = '''
select * from NASDAQ
'''
remote_NASDAQ = pd.read_sql(query, conn)
remote_NASDAQ.head(2)

        Date  Open  High   Low  Close  Adj Close      Volume
0 2000-01-03  4186  4192  3990   4131       4131  1510070000
1 2000-01-04  4020  4073  3898   3902       3902  1511840000